Tekla Open API Reference for Tekla Structures 2025
StructuresDialogArrayAttribute Properties
The StructuresDialogArrayAttribute type exposes the following members.
Properties
Name | Description
AttributeName
 Gets the attribute name of the interface.
Top
See Also
Reference
StructuresDialogArrayAttribute Class
Tekla.Structures.Dialog Namespace